# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент,
#  второй и предпоследний и т.д.
# *Пример:*
# - [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
# - [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5]) 

l = list(map(int, input("Введите числа через пробел: ").split()))
product = []
for i in range(0, (len(l) + 1) // 2):
    product.append(l[i] * l[-1 - i])
print(product)